Fese673/ZEGAR-ESP32/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <WiFi.h>
#include <time.h>
#include <Esp.h>

#include "STM32_Data.h"
#include "LCDMirror.h"
#include "UI_Controller.h"
#include "Encoder.h"
#include "AppState.h"
#include "UI_Draw.h"
#include "WiFiSync.h"
#include "RTCService.h"

#include <sys/time.h>
#include "MQTTSync.h"
#include "StatsManager.h" 
#include "AudioBT.h" 
#include "ModeManager.h"
#include "RadioModeSwitch.h"
#include "PMS_Czujnik.h"
#include "ENS160AHT21Screen.h"
#include "ENS160AHT21Sensor.h"
#include <DHT.h>
#include "TemperatureConfig.h"
#include "I2C_bus_shared.h"

// ============================================================================
// STAŁE CZASOWE (zamiast magic numbers)
// ============================================================================
constexpr unsigned long CLOCK_TICK_MS       = 1000; // tykanie zegara co 1s
constexpr unsigned long MELODY_STEP_MS      = 300;  // krok melodii alarmu
constexpr unsigned long ALARM_DURATION_MS   = 5000; // jak długo gra alarm
constexpr unsigned long STM32_UPDATE_MS     = 500;  // odświeżanie danych STM32
constexpr unsigned long STM32_TIMEOUT_MS    = 3000; // timeout połączenia STM32
constexpr unsigned long STOPER_DRAW_MS      = 100;  // odświeżanie stopera
constexpr unsigned long WIFI_RETRY_DELAY_MS = 500;  // próba połączenia WiFi
constexpr int           WIFI_MAX_RETRIES    = 20;   // max prób połączenia
constexpr unsigned long MSG_DISPLAY_MS      = 1500; // wyświetlanie komunikatów

// ============================================================================
// HOME LCD refresh policy
// ============================================================================
// Wymóg: ekran HOME (LCD + UART mirror) ma odświeżać się maks. 1x/s.
// Zamiast wołać drawHome() bezpośrednio z wielu miejsc, używamy bramki:
// - requestHomeRedraw(): zaznacza, że HOME wymaga odświeżenia
// - serviceHomeRedraw(): wykonuje drawHome() nie częściej niż co 1000ms
static bool          s_homeRedrawDirty      = true;
static unsigned long s_lastHomeRedrawMs    = 0;
static constexpr unsigned long HOME_REDRAW_MIN_INTERVAL_MS = 1000;

// Rotacja zawartości HOME: na zmianę klasyczny HOME i ekran powietrza.
// Wymóg: nie zwiększać częstotliwości rysowania (nadal max 1Hz).
enum class HomeOverlay : uint8_t {
  Time = 0,
  Air  = 1,
};

static HomeOverlay   s_homeOverlay          = HomeOverlay::Time;
static unsigned long s_homeOverlaySinceMs  = 0;
// Runtime-configurable overlay switch interval (ms). Persisted via Preferences as seconds.
unsigned long s_homeOverlaySwitchMs = 7000; // default 7s
int settingsRotationSec = 7;               // 1..10 seconds (user-facing)
int s_prevSettingsRotationSec = 7;         // used to restore on cancel

// Preferences namespace object (for persistent settings)
#include <Preferences.h>
Preferences s_prefs;

static void requestHomeRedraw() {
  s_homeRedrawDirty = true;
}

static void serviceHomeRedraw() {
  if (appState != STATE_HOME) return;
  if (!s_homeRedrawDirty) return;

  const unsigned long nowMs = millis();
  if (s_lastHomeRedrawMs != 0 && (nowMs - s_lastHomeRedrawMs) < HOME_REDRAW_MIN_INTERVAL_MS) {
    return;
  }

  s_lastHomeRedrawMs = nowMs;
  s_homeRedrawDirty  = false;

  // Jedyna ścieżka, która fizycznie rysuje na LCD (+ mirror UART).
  if (s_homeOverlay == HomeOverlay::Air) {
    drawAirScreen();
  } else {
    drawHome();
  }
}

// Zamiast bezpośredniego drawHome() w kodzie aplikacji wywołuj to.
static void drawHomeThrottled() {
  requestHomeRedraw();
  serviceHomeRedraw();
}

static void serviceHomeOverlayRotation() {
  if (appState != STATE_HOME) return;

  const unsigned long nowMs = millis();
  if (s_homeOverlaySinceMs == 0) {
    s_homeOverlaySinceMs = nowMs;
    s_homeOverlay = HomeOverlay::Time;
    requestHomeRedraw();
    return;
  }
  if (nowMs - s_homeOverlaySinceMs >= s_homeOverlaySwitchMs) {
    s_homeOverlaySinceMs = nowMs;
    s_homeOverlay = (s_homeOverlay == HomeOverlay::Time) ? HomeOverlay::Air : HomeOverlay::Time;
    requestHomeRedraw();
  }
}

static void handleHomeEntryIfStateChanged() {
  static AppState lastState = STATE_HOME;
  if (appState == lastState) return;

  // We just entered HOME: start from TIME view for 3 seconds.
  if (appState == STATE_HOME) {
    s_homeOverlay = HomeOverlay::Time;
    s_homeOverlaySinceMs = millis();
    requestHomeRedraw();
  }

  lastState = appState;
}
constexpr unsigned long SETUP_DELAY_MS      = 100;  // min delay for serial init

// ============================================================================
// DEKLARACJE FUNKCJI (dla PlatformIO)
// ============================================================================


// --- Logika zegara ---
void tickClock();
void playAlarmMelody();

// --- Wrapper dla kompatybilności ---
void syncTimeFromWiFi() {
  // Uruchom sync w trybie Wi-Fi, wymuszając wyłączenie BT.
  ModeManager::wifiOn();
}

// --- zasoby systemu ---
void drawSystemResources();

// ============================================================================
// KONFIGURACJA SPRZĘTU (PINY + STAŁE)
// ============================================================================

// --- 7-SEG (74HC595) - piny zdefiniowane w UI_Draw.h jako makra ---
// DATA_PIN = 23, CLOCK_PIN = 18, LATCH_PIN = 5

// --- Buzzer ---
constexpr uint8_t BUZZER_PIN = 19;
const int melodyFreq[] = {1000, 1400, 1000, 1600};
constexpr int MELODY_LEN = 4;

// --- Encoder (piny dla encoder_begin) ---
constexpr uint8_t ENC_CLK = 25;
constexpr uint8_t ENC_DT  = 26;
constexpr uint8_t ENC_SW  = 27;

// --- UART / Komunikacja ---
constexpr long UART_BAUD = 115200;
HardwareSerial& uart = Serial2;

// --- WiFi / NTP ---
const char* const WIFI_SSID  = "Orange_Swiatlowod_98E2";
const char* const WIFI_PASS  = "x1Z6P(~8pry<St.";
const char* const NTP_SERVER = "pool.ntp.org";

// --- LCD Custom Character ---
byte alarmIcon[8] = {
  B00100,
  B01110,
  B01110,
  B11111,
  B11111,
  B00100,
  B00000,
  B00000
};

// --- DHT Sensor ---
// --- DHT11 ---
#define DHT_PIN 4
#define DHT_TYPE DHT11

// --- DHT11 ---
void updateDHT();
void drawTemperature();
void drawHumidity();
void showTemperature7Seg();
void showHumidity7Seg();


// ============================================================================
// ZMIENNE GLOBALNE (pogrupowane funkcjonalnie)
// ============================================================================

